"""
构建是否举办活动的决策树
"""
import operator
import math

class DecisionTree:
    def __init__(self):
        pass

    # 加载数据
    def loadData(self):
        # 天气晴（2）阴（1）雨（0）
        # 温度炎热（2)适中（1）寒冷（0）
        # 湿度高（1）正常（0）
        # 风速强（1）弱（0）
        # 举办活动（yes)不举办活动（no）
        data = [
            [2,2,1,0,"yes"],
            [2,2,1,1,'no'],
            [1,2,1,0,'yes'],
            [0,0,0,0,'yes'],
            [0,0,0,1,'no'],
            [1,0,0,1,'yes'],
            [2,1,1,0,'no'],
            [2,0,0,0,'yes'],
            [0,1,0,0,'yes'],
            [2,1,0,1,'yes'],
            [1,2,0,0,'no'],
            [0,1,1,1,'no']
        ]
        features = ["天气",'温度','湿度','风速']
